Autodesk.Revit.DB.Lighting.PointLightShape.#ctor(Autodesk.Revit.DB.Lighting.PointLightShape)
Creates a copy of the given point light shape
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2013

Autodesk.Revit.DB.Lighting.PointLightShape.#ctor
Creates a point light shape object.
Since:
2013

Autodesk.Revit.DB.Lighting.PointLightShape
This class encapsulates a point light shape.
Since:
2013